{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "BertForSequenceClassification",
    "parent_library": "transformers.models.bert.modeling_bert"
  },
  "base_model_name_or_path": "ProsusAI/finbert",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 16,
  "lora_dropout": 0.1,
  "modules_to_save": [
    "classifier"
  ],
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "query",
    "value",
    "classifier"
  ],
  "task_type": null
}